IDENTIFICATION DIVISION.
PROGRAM-ID. EULERCOBOL1.
AUTHOR. 6C1.
DATE-WRITTEN. 17-05-13.
DATE-COMPILED.

DATA DIVISION.
WORKING-STORAGE SECTION.
77 COUNTER PIC 9(5).
77 TOTAL PIC 9(6).
77 R3 PIC 9.
77 R5 PIC 9.
77 DUMP PIC 9(1).

PROCEDURE DIVISION.
MAINLINE.
    SET COUNTER TO 3.
    PERFORM LOOP UNTIL COUNTER = 1000.
    DISPLAY TOTAL.
    STOP RUN.
LOOP.
    DIVIDE 3 INTO COUNTER GIVING DUMP REMAINDER R3.
    DIVIDE 5 INTO COUNTER GIVING DUMP REMAINDER R5.
    IF R3 = 0 OR R5 = 0 THEN ADD COUNTER TO TOTAL END-IF.
    ADD 1 TO COUNTER.
