IDENTIFICATION DIVISION.
PROGRAM-ID. EULER2.

DATA DIVISION.
WORKING-STORAGE SECTION.
    77 FOUR-MILLION PIC 9(7).
    77 TOTAL PIC 9(16).
    77 A PIC 9(7).
    77 B PIC 9(7).

PROCEDURE DIVISION.
MAINLINE.
    SET A TO 0.
    SET B TO 1.
    STOP RUN.
