IDENTIFICATION DIVISION.
PROGRAM-ID. EULER2.

DATA DIVISION.
WORKING-STORAGE SECTION.
    77 TOTAL PIC 9(16).
    77 A PIC 9(7).
    77 B PIC 9(7).
    77 C PIC 9(7).
    77 R PIC 9.

PROCEDURE DIVISION.
MAINLINE.
    SET A TO 0.
    SET B TO 1.
    PERFORM UNTIL B > 4000000
        COMPUTE C = FUNCTION SUM ( A, B )
        SET A TO B
        SET B TO C
        COMPUTE R = FUNCTION REM(A,2)
        IF R = 0 THEN
            ADD A TO TOTAL
        END-IF
    END-PERFORM.
    DISPLAY TOTAL
    STOP RUN.
