IDENTIFICATION DIVISION.
PROGRAM-ID. EULER3.

DATA DIVISION.
WORKING-STORAGE SECTION.
    77 N PIC 9(12).
    77 ROOT PIC 9(7).
    77 I PIC 9(7).
    77 R PIC 9(7).
    77 DONE PIC 9.
PROCEDURE DIVISION.
MAINLINE.
    SET R TO 1.
    SET I TO 2.
    SET N TO 600851475143.
    COMPUTE ROOT = FUNCTION SQRT(N).
    PERFORM FACTOR.
    DISPLAY "..."
    DISPLAY N.
    DISPLAY "DONE".
    STOP RUN.
FACTOR.
    PERFORM WITH TEST BEFORE UNTIL DONE = 1
        COMPUTE R = FUNCTION REM(N,I)
        IF R = 0 THEN
            DIVIDE I INTO N GIVING N
            DISPLAY N
        END-IF
        ADD 1 TO I
        IF I > ROOT THEN
            ADD 1 TO DONE
        END-IF
    END-PERFORM.
