IDENTIFICATION DIVISION.
PROGRAM-ID. EULER5.

DATA DIVISION.
WORKING-STORAGE SECTION.
    77 TOTAL PIC 9(10).
    
PROCEDURE DIVISION.
MAINLINE.
    DISPLAY "Product of p * floor(log_p (20)) for p prime."
    STOP-RUN.
